
* Design
  Operations:

   - Adding
   - Deleting
   - Searching
   - iterating

#+NAME: 96b59284-0381-4425-9a6b-169cce3c5155
  #+BEGIN_SRC ein :session http://localhost:8888/Islands/Interactive Consoles.ipynb
  import networkx as nx
  from uuid import uuid4

  class EntityManager(object):
      def __init__(self):
          self._entities = nx.Graph()
          self._eclasses = nx.Graph()

      def register_eclass(name):
          return self._eclasses.add_node(name)

      def add_entity(self, name, eclass='object', short_desc="", long_desc=""):
          id = uuid4()
          self._eclasses.add_node(id)
          self._eclasses.add_edge(eclass, id)
          return self._entities.add_node(id, name=name)

  #+END_SRC

  #+RESULTS: 96b59284-0381-4425-9a6b-169cce3c5155
  : [....]

  #+RESULTS:

* Tree
  :PROPERTIES:
  :x:        0
  :y:        0
  :glyph:    '^'
  :END:
  
